programming/2014-10-06-string-in-C++.org
#+TITLE: String in C++
#+AUTHOR: Micky Ching
#+OPTIONS: H:4 ^:nil toc:nil
#+LATEX_CLASS: latex-doc
#+PAGE_CATEGORIES: programming C++

* string的定义
首先我们需要知道在C++中string是以一个库的形式提供的，
由于C++引入了命名空间的概念，所以string实际处于命名空间std中。
为了避免累赘，这里忽略命名空间的概念，直接引用string。

要使用string，必须要要包含头文件<string>。接下来可以看一下string类的定义：
#+BEGIN_SRC cpp
  typedef basic_string<char> string;
#+END_SRC
从这里可以看到，实际上string类是模板类basic_string的一个实例，
用char字符来实例化，如果熟悉basic_string可以利用它来实现其他类型的string，
也就是除了字符串以外还能轻松实现其他类型的串。

既然提到basic_string不妨看一下它长什么样子：
#+BEGIN_SRC cpp
  template < class charT,
             class traits = char_traits<charT>,
             class Alloc = allocator<charT>
             > class basic_string;
#+END_SRC
- charT :: 设计者对这个模板参数提出了一个要求，必须是非数组的POD类型。

  因为我们要实现一个串，所以不让串的元素本身是串，这是比较容易理解的。
  另一方面要求是POD类型，称之为Plain Old Type，就是源于C的那些数据类型。

- traits :: 定义一组特征。
- Alloc :: 提供分配内存的方法。

一般情况不会去修改traits和Alloc，因为默认的就实现的很好了，如果我们想使用其他类型的串，
就可以简单添加typedef实现。
例如标准库里面已经提供了如下类型：
#+BEGIN_SRC cpp
  typedef basic_string<wchar_t> wstring;
  typedef basic_string<char16_t> u16string;
  typedef basic_string<char32_t> u32string;
#+END_SRC

* 数据成员
我们可以认为数据成员已经被完全封装，虽然有一个npos可以访问，
但它是一个全局静态常量，其含义是size_type能表示的最大值。
#+BEGIN_SRC cpp
  static const size_type npos = -1;
#+END_SRC

