programming/2014-10-06-string-in-C++.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>String in C++</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Micky Ching" />
<link rel="stylesheet" href="../theme/default.css" />


</head>
<body>
<div id="content">
<h1 class="title">String in C++</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. string的定义</a></li>
<li><a href="#sec-2">2. 数据成员</a></li>
<li><a href="#sec-3">3. 函数成员</a></li>
<li><a href="#sec-4">4. 库函数</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> string的定义</h2>
<div class="outline-text-2" id="text-1">
<p>
首先我们需要知道在C++中string是以一个库的形式提供的，
由于C++引入了命名空间的概念，所以string实际处于命名空间std中。
为了避免累赘，这里忽略命名空间的概念，直接引用string。
</p>

<p>
要使用string，必须要要包含头文件&lt;string&gt;。接下来可以看一下string类的定义：
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff; font-weight: bold;">typedef</span> <span style="color: #0000ff;">basic_string</span>&lt;<span style="color: #0000ff;">char</span>&gt; <span style="color: #0000ff;">string</span>;
</pre>
</div>
<p>
从这里可以看到，实际上string类是模板类basic_string的一个实例，
用char字符来实例化，如果熟悉basic_string可以利用它来实现其他类型的string，
也就是除了字符串以外还能轻松实现其他类型的串。
</p>

<p>
既然提到basic_string不妨看一下它长什么样子：
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff; font-weight: bold;">template</span> &lt; <span style="color: #0000ff; font-weight: bold;">class</span> <span style="color: #0000ff;">charT</span>,
           <span style="color: #0000ff; font-weight: bold;">class</span> <span style="color: #0000ff;">traits</span> = <span style="color: #0000ff;">char_traits</span>&lt;<span style="color: #0000ff;">charT</span>&gt;,
           <span style="color: #0000ff; font-weight: bold;">class</span> <span style="color: #0000ff;">Alloc</span> = <span style="color: #0000ff;">allocator</span>&lt;<span style="color: #0000ff;">charT</span>&gt;
           &gt; <span style="color: #0000ff; font-weight: bold;">class</span> <span style="color: #0000ff;">basic_string</span>;
</pre>
</div>
<dl class="org-dl">
<dt> charT </dt><dd>设计者对这个模板参数提出了一个要求，必须是非数组的POD类型。

<p>
因为我们要实现一个串，所以不让串的元素本身是串，这是比较容易理解的。
另一方面要求是POD类型，称之为Plain Old Type，就是源于C的那些数据类型。
</p>
</dd>

<dt> traits </dt><dd>定义一组特征。
</dd>
<dt> Alloc </dt><dd>提供分配内存的方法。
</dd>
</dl>

<p>
一般情况不会去修改traits和Alloc，因为默认的就实现的很好了，如果我们想使用其他类型的串，
就可以简单添加typedef实现。
例如标准库里面已经提供了如下类型：
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff; font-weight: bold;">typedef</span> <span style="color: #0000ff;">basic_string</span>&lt;<span style="color: #0000ff;">wchar_t</span>&gt; <span style="color: #0000ff;">wstring</span>;
<span style="color: #0000ff; font-weight: bold;">typedef</span> <span style="color: #0000ff;">basic_string</span>&lt;<span style="color: #0000ff;">char16_t</span>&gt; <span style="color: #0000ff;">u16string</span>;
<span style="color: #0000ff; font-weight: bold;">typedef</span> <span style="color: #0000ff;">basic_string</span>&lt;<span style="color: #0000ff;">char32_t</span>&gt; <span style="color: #0000ff;">u32string</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 数据成员</h2>
<div class="outline-text-2" id="text-2">
<p>
我们可以认为数据成员已经被完全封装，虽然有一个npos可以访问，
但它是一个全局静态常量，其含义是size_type能表示的最大值。
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff; font-weight: bold;">static</span> <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">size_type</span> <span style="color: #000000;">npos</span> = -1;
</pre>
</div>
</div>
</div>
