programming/2014-10-06-string-in-C++.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 函数成员</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #8b008b; font-weight: bold;">string</span>();
<span style="color: #8b008b; font-weight: bold;">string</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#20174;&#32473;&#23450;str&#30340;&#19979;&#26631;pos&#24320;&#22987;&#22797;&#21046;&#26368;&#22810;len&#20010;&#23383;&#31526;&#12290;</span>
<span style="color: #8b008b; font-weight: bold;">string</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span> = npos);
<span style="color: #8b008b; font-weight: bold;">string</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#20174;&#23383;&#31526;&#20018;&#22797;&#21046;&#26368;&#22810;n&#20010;&#23383;&#31526;&#12290;</span>
<span style="color: #8b008b; font-weight: bold;">string</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>);
<span style="color: #8b008b; font-weight: bold;">string</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>, <span style="color: #0000ff;">char</span> <span style="color: #000000;">c</span>);
<span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#20174;&#36845;&#20195;&#22120;&#22797;&#21046;&#12290;</span>
<span style="color: #0000ff; font-weight: bold;">template</span> &lt;<span style="color: #0000ff; font-weight: bold;">class</span> <span style="color: #0000ff;">InputIterator</span>&gt;
<span style="color: #8b008b; font-weight: bold;">string</span>(<span style="color: #0000ff;">InputIterator</span> <span style="color: #000000;">first</span>, <span style="color: #0000ff;">InputIterator</span> <span style="color: #000000;">last</span>);
</pre>
</div>

<p>
析构函数对使用者来说其实没有什么需要注意的，
只需要在动态申请是能记得释放就可以了。
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff;">string</span> &amp;<span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">=</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">=</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">=</span>(<span style="color: #0000ff;">char</span> <span style="color: #000000;">c</span>);
</pre>
</div>

<p>
迭代器方法和其他容器类几乎一样，如果熟悉vector就知道有哪些：
begin()，end()，rbegin()，rend()，cbegin()，cend()，crbegin()，crend()。
其中r的含义是reverse，而c的含义是const。
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff;">size_t</span> <span style="color: #8b008b; font-weight: bold;">size</span>() <span style="color: #0000ff; font-weight: bold;">const</span>;                    <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#23601;&#26159;&#24635;&#20849;&#22810;&#23569;&#20010;&#23383;&#31526;</span>
<span style="color: #0000ff;">size_t</span> <span style="color: #8b008b; font-weight: bold;">length</span>() <span style="color: #0000ff; font-weight: bold;">const</span>;                  <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#23383;&#31526;&#20018;&#38271;&#24230;&#65292;&#21516;size()</span>
<span style="color: #0000ff;">size_t</span> <span style="color: #8b008b; font-weight: bold;">max_size</span>() <span style="color: #0000ff; font-weight: bold;">const</span>;                <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#31995;&#32479;&#21487;&#20197;&#20998;&#37197;&#30340;&#26368;&#22823;&#38271;&#24230;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">resize</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>);
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">resize</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>, <span style="color: #0000ff;">char</span> <span style="color: #000000;">c</span>);          <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#22686;&#21152;&#30340;&#37096;&#20998;&#29992;c&#22635;&#20805;</span>
<span style="color: #0000ff;">size_t</span> <span style="color: #8b008b; font-weight: bold;">capacity</span>() <span style="color: #0000ff; font-weight: bold;">const</span>;                <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#24403;&#21069;&#20998;&#37197;&#21040;&#30340;&#20869;&#23384;&#38271;&#24230;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">clear</span>();                           <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#23558;&#23383;&#31526;&#20018;&#25830;&#38500;&#65292;&#38271;&#24230;&#21464;&#20026;0</span>
<span style="color: #0000ff;">bool</span> <span style="color: #8b008b; font-weight: bold;">empty</span>() <span style="color: #0000ff; font-weight: bold;">const</span>;                     <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#29992;&#20110;&#26816;&#26597;&#26159;&#21542;&#20026;&#31354;&#23383;&#31526;&#20018;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">reserve</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span> = 0);             <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#35774;&#32622;&#39044;&#30041;&#38271;&#24230;</span>
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">shrink_to_fit</span>();                   <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#28165;&#38500;&#39044;&#30041;&#38271;&#24230;</span>
</pre>
</div>
<dl class="org-dl">
<dt> resize() </dt><dd>  如果往小的调整，实际上不会释放内存，只会减少字符串长度，
如果要扩大，增加字符串长度，如果超出capacity则会重新分配内存。
</dd>

<dt> reserve() </dt><dd>  在请求减少容量的时候并不一定会真的减少容量，这取决于编译器的实现。
shrink_to_fit()同样如此。
</dd>
</dl>

<p>
下标操作有[index]和at(index)两种方法，后者会检查是否越界，而前者不会检查。
back()和front()用于返回最后一个和第一个字符。
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff;">string</span> &amp;<span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">+=</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">+=</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">+=</span>(<span style="color: #0000ff;">char</span> <span style="color: #000000;">c</span>);

<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">append</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">append</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">subpos</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">sublen</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">append</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">append</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">append</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>, <span style="color: #0000ff;">char</span> <span style="color: #000000;">c</span>);
<span style="color: #0000ff; font-weight: bold;">template</span> &lt;<span style="color: #0000ff; font-weight: bold;">class</span> <span style="color: #0000ff;">InputIterator</span>&gt;
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">append</span>(<span style="color: #0000ff;">InputIterator</span> <span style="color: #000000;">first</span>, <span style="color: #0000ff;">InputIterator</span> <span style="color: #000000;">last</span>);

<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">push_back</span>(<span style="color: #0000ff;">char</span> <span style="color: #000000;">c</span>);

<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">assign</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">assign</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">subpos</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">sublen</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">assign</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">assign</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">assign</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>, <span style="color: #0000ff;">char</span> <span style="color: #000000;">c</span>);
<span style="color: #0000ff; font-weight: bold;">template</span> &lt;<span style="color: #0000ff; font-weight: bold;">class</span> <span style="color: #0000ff;">InputIterator</span>&gt;
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">assign</span>(<span style="color: #0000ff;">InputIterator</span> <span style="color: #000000;">first</span>, <span style="color: #0000ff;">InputIterator</span> <span style="color: #000000;">last</span>);

<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">insert</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">insert</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>,
               <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">subpos</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">sublen</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">insert</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">insert</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">insert</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>, <span style="color: #0000ff;">char</span> <span style="color: #000000;">c</span>);
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">insert</span>(<span style="color: #0000ff;">iterator</span> <span style="color: #000000;">p</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>, <span style="color: #0000ff;">char</span> <span style="color: #000000;">c</span>);
<span style="color: #0000ff;">iterator</span> <span style="color: #8b008b; font-weight: bold;">insert</span>(<span style="color: #0000ff;">iterator</span> <span style="color: #000000;">p</span>, <span style="color: #0000ff;">char</span> <span style="color: #000000;">c</span>);
<span style="color: #0000ff; font-weight: bold;">template</span> &lt;<span style="color: #0000ff; font-weight: bold;">class</span> <span style="color: #0000ff;">InputIterator</span>&gt;
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">insert</span>(<span style="color: #0000ff;">iterator</span> <span style="color: #000000;">p</span>, <span style="color: #0000ff;">InputIterator</span> <span style="color: #000000;">first</span>, <span style="color: #0000ff;">InputIterator</span> <span style="color: #000000;">last</span>);

<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">erase</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span> = 0, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span> = npos);
<span style="color: #0000ff;">iterator</span> <span style="color: #8b008b; font-weight: bold;">erase</span>(<span style="color: #0000ff;">iterator</span> <span style="color: #000000;">p</span>);
<span style="color: #0000ff;">iterator</span> <span style="color: #8b008b; font-weight: bold;">erase</span>(<span style="color: #0000ff;">iterator</span> <span style="color: #000000;">first</span>, <span style="color: #0000ff;">iterator</span> <span style="color: #000000;">last</span>);

<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">replace</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>,  <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span>,  <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">replace</span>(<span style="color: #0000ff;">iterator</span> <span style="color: #000000;">i1</span>, <span style="color: #0000ff;">iterator</span> <span style="color: #000000;">i2</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">replace</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>,  <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span>,  <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>,
                 <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">subpos</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">sublen</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">replace</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>,  <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span>,  <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">replace</span>(<span style="color: #0000ff;">iterator</span> <span style="color: #000000;">i1</span>, <span style="color: #0000ff;">iterator</span> <span style="color: #000000;">i2</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">replace</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>,  <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span>,  <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">replace</span>(<span style="color: #0000ff;">iterator</span> <span style="color: #000000;">i1</span>, <span style="color: #0000ff;">iterator</span> <span style="color: #000000;">i2</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">replace</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>,  <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span>,  <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>, <span style="color: #0000ff;">char</span> <span style="color: #000000;">c</span>);
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">replace</span>(<span style="color: #0000ff;">iterator</span> <span style="color: #000000;">i1</span>, <span style="color: #0000ff;">iterator</span> <span style="color: #000000;">i2</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>, <span style="color: #0000ff;">char</span> <span style="color: #000000;">c</span>);
<span style="color: #0000ff; font-weight: bold;">template</span> &lt;<span style="color: #0000ff; font-weight: bold;">class</span> <span style="color: #0000ff;">InputIterator</span>&gt;
<span style="color: #0000ff;">string</span> &amp;<span style="color: #8b008b; font-weight: bold;">replace</span>(<span style="color: #0000ff;">iterator</span> <span style="color: #000000;">i1</span>, <span style="color: #0000ff;">iterator</span> <span style="color: #000000;">i2</span>,
                <span style="color: #0000ff;">InputIterator</span> <span style="color: #000000;">first</span>, <span style="color: #0000ff;">InputIterator</span> <span style="color: #000000;">last</span>);

<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">swap</span>(<span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>);
<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">pop_back</span>();
</pre>
</div>
<p>
复合加法，也就是+=实际上是在尾部添加，和append()一样，push_back()也是向尾部添加。
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #8b008b; font-weight: bold;">c_str</span>() <span style="color: #0000ff; font-weight: bold;">const</span>;              <span style="color: #228b22; font-style: italic;">// </span><span style="color: #228b22; font-style: italic;">&#33719;&#21462;C&#23383;&#31526;&#20018;</span>
<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #8b008b; font-weight: bold;">data</span>() <span style="color: #0000ff; font-weight: bold;">const</span>;
<span style="color: #0000ff;">allocator_type</span> <span style="color: #8b008b; font-weight: bold;">get_allocator</span>() <span style="color: #0000ff; font-weight: bold;">const</span>;
<span style="color: #0000ff;">size_t</span> <span style="color: #8b008b; font-weight: bold;">copy</span>(<span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span> = 0) <span style="color: #0000ff; font-weight: bold;">const</span>;

<span style="color: #0000ff;">size_t</span> <span style="color: #8b008b; font-weight: bold;">find</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span> = 0) <span style="color: #0000ff; font-weight: bold;">const</span>;
<span style="color: #0000ff;">size_t</span> <span style="color: #8b008b; font-weight: bold;">find</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span> = 0) <span style="color: #0000ff; font-weight: bold;">const</span>;
<span style="color: #0000ff;">size_t</span> <span style="color: #8b008b; font-weight: bold;">find</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>) <span style="color: #0000ff; font-weight: bold;">const</span>;
<span style="color: #0000ff;">size_t</span> <span style="color: #8b008b; font-weight: bold;">find</span>(<span style="color: #0000ff;">char</span> <span style="color: #000000;">c</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span> = 0) <span style="color: #0000ff; font-weight: bold;">const</span>;

<span style="color: #0000ff;">size_t</span> <span style="color: #8b008b; font-weight: bold;">find_first_of</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span> = 0) <span style="color: #0000ff; font-weight: bold;">const</span>;
<span style="color: #0000ff;">size_t</span> <span style="color: #8b008b; font-weight: bold;">find_first_of</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span> = 0) <span style="color: #0000ff; font-weight: bold;">const</span>;
<span style="color: #0000ff;">size_t</span> <span style="color: #8b008b; font-weight: bold;">find_first_of</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>) <span style="color: #0000ff; font-weight: bold;">const</span>;
<span style="color: #0000ff;">size_t</span> <span style="color: #8b008b; font-weight: bold;">find_first_of</span>(<span style="color: #0000ff;">char</span> <span style="color: #000000;">c</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span> = 0) <span style="color: #0000ff; font-weight: bold;">const</span>;

<span style="color: #0000ff;">string</span> <span style="color: #8b008b; font-weight: bold;">substr</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span> = 0, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span> = npos) <span style="color: #0000ff; font-weight: bold;">const</span>;

<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">compare</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>) <span style="color: #0000ff; font-weight: bold;">const</span>;
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">compare</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>) <span style="color: #0000ff; font-weight: bold;">const</span>;
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">compare</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>,
             <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">subpos</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">sublen</span>) <span style="color: #0000ff; font-weight: bold;">const</span>;
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">compare</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>) <span style="color: #0000ff; font-weight: bold;">const</span>;
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">compare</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>) <span style="color: #0000ff; font-weight: bold;">const</span>;
<span style="color: #0000ff;">int</span> <span style="color: #8b008b; font-weight: bold;">compare</span>(<span style="color: #0000ff;">size_t</span> <span style="color: #000000;">pos</span>, <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">len</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span> *<span style="color: #000000;">s</span>,
            <span style="color: #0000ff;">size_t</span> <span style="color: #000000;">n</span>) <span style="color: #0000ff; font-weight: bold;">const</span>;
</pre>
</div>
<dl class="org-dl">
<dt> find() </dt><dd>  如果没找到，返回npos。
<code>rfind()</code> 和find()形式相同，默认参数是npos。

<p>
find_first_of()系列包括find_last_of()、find_first_not_of()、
find_last_not_of()。
原型完全一致，find_first_of()用于查找指定串中的任意一个字符的首次出现，
find_first_not_of()查找指定串以外任意一个字符的首次出现。
</p>
</dd>
</dl>
</div>
</div>
