programming/2014-10-06-string-in-C++.org
* 库函数
库函数用于操作string但是它不属于成员函数。
#+BEGIN_SRC cpp
  string operator+(const string &lhs, const string &rhs);
  string operator+(const string &lhs, const char   *rhs);
  string operator+(const char   *lhs, const string &rhs);
  string operator+(const string &lhs, char          rhs);
  string operator+(char          lhs, const string &rhs);

  bool operator==(const string &lhs, const string &rhs);
  bool operator==(const char   *lhs, const string &rhs);
  bool operator==(const string &lhs, const char   *rhs);

  void swap(string &x, string &y);

  istream &operator>>(istream &is, string &str);
  ostream &operator<<(ostream &os, const string &str);

  istream &getline(istream &is, string &str, char delim);
  istream &getline(istream &is, string &str);
#+END_SRC

比较操作符==、!=、<、<=、>、>=具有完全相同的函数原型和用法，
因此只需要参考==即可。
