programming/2014-10-06-string-in-C++.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 库函数</h2>
<div class="outline-text-2" id="text-4">
<p>
库函数用于操作string但是它不属于成员函数。
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #0000ff;">string</span> <span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">+</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">lhs</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">rhs</span>);
<span style="color: #0000ff;">string</span> <span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">+</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">lhs</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span>   *<span style="color: #000000;">rhs</span>);
<span style="color: #0000ff;">string</span> <span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">+</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span>   *<span style="color: #000000;">lhs</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">rhs</span>);
<span style="color: #0000ff;">string</span> <span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">+</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">lhs</span>, <span style="color: #0000ff;">char</span>          <span style="color: #000000;">rhs</span>);
<span style="color: #0000ff;">string</span> <span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">+</span>(<span style="color: #0000ff;">char</span>          <span style="color: #000000;">lhs</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">rhs</span>);

<span style="color: #0000ff;">bool</span> <span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">==</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">lhs</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">rhs</span>);
<span style="color: #0000ff;">bool</span> <span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">==</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span>   *<span style="color: #000000;">lhs</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">rhs</span>);
<span style="color: #0000ff;">bool</span> <span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">==</span>(<span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">lhs</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">char</span>   *<span style="color: #000000;">rhs</span>);

<span style="color: #0000ff;">void</span> <span style="color: #8b008b; font-weight: bold;">swap</span>(<span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">x</span>, <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">y</span>);

<span style="color: #0000ff;">istream</span> &amp;<span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">&gt;&gt;</span>(<span style="color: #0000ff;">istream</span> &amp;<span style="color: #000000;">is</span>, <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>);
<span style="color: #0000ff;">ostream</span> &amp;<span style="color: #0000ff; font-weight: bold;">operator</span><span style="color: #8b008b; font-weight: bold;">&lt;&lt;</span>(<span style="color: #0000ff;">ostream</span> &amp;<span style="color: #000000;">os</span>, <span style="color: #0000ff; font-weight: bold;">const</span> <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>);

<span style="color: #0000ff;">istream</span> &amp;<span style="color: #8b008b; font-weight: bold;">getline</span>(<span style="color: #0000ff;">istream</span> &amp;<span style="color: #000000;">is</span>, <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>, <span style="color: #0000ff;">char</span> <span style="color: #000000;">delim</span>);
<span style="color: #0000ff;">istream</span> &amp;<span style="color: #8b008b; font-weight: bold;">getline</span>(<span style="color: #0000ff;">istream</span> &amp;<span style="color: #000000;">is</span>, <span style="color: #0000ff;">string</span> &amp;<span style="color: #000000;">str</span>);
</pre>
</div>

<p>
比较操作符==、!=、&lt;、&lt;=、&gt;、&gt;=具有完全相同的函数原型和用法，
因此只需要参考==即可。
</p>
</div>
</div>
</div>
</body>
</html>
